app/controllers/business_cases_controller.rb

SELECT "business_cases".* FROM "business_cases"
---
  def index
    @business_cases = BusinessCase.all