app/controllers/business_cases_controller.rb

INSERT INTO "business_cases" ("client_location", "client_industry", "client_size", "user_expertise", "client_problem", "user_methodology", "client_results", "client_comments", "user_link", "title", "client_position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @business_case = BusinessCase.new(business_case_params)
    @business_case.update(user: current_user)
    respond_to do |format|
      if @business_case.save

UPDATE "business_cases" SET "client_location" = ?, "updated_at" = ? WHERE "business_cases"."id" = ?  [["client_location", "COUCOU IOSUGHSOIDUJNG"], ["updated_at", "2018-06-22 10:50:31.022622"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @business_case.update(business_case_params)

DELETE FROM "business_cases" WHERE "business_cases"."id" = ?  [["id", 3]]
---
  def destroy
    @business_case.destroy

SELECT  "business_cases".* FROM "business_cases" WHERE "business_cases"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_business_case
    redirect_to business_cases_url, notice: 'Business case was not found.' unless current_user
    @business_case = current_user.business_cases.find(params[:id]) if current_user